MathDaw/SMWM_STM32/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : STM32L476 Nucleo-64 Workbench Tests @ WUT Mchtr
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2020 STMicroelectronics.<br>
  * Copyright (c) 2021 Mateusz Szumilas @ WUT Faculty of Mechatronics.<br>
  * All rights reserved.
  *
  * This software component is licensed under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/

//<<<<<<< HEAD
/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "string.h"
#include "lcd.h"
#include <flick.h>
#include <lsm6ds33_reg.h>
#include <main.h>
#include <math.h>
#include <stdio.h>
#include <stm32_adafruit_lcd.h>
#include <stm32_hal_legacy.h>
#include <stm32l476xx.h>
#include <stm32l4xx_hal_def.h>
#include <stm32l4xx_hal_flash.h>
#include <stm32l4xx_hal_gpio.h>
#include <stm32l4xx_hal_i2c.h>
#include <stm32l4xx_hal_i2c_ex.h>
#include <stm32l4xx_hal_pwr_ex.h>
#include <stm32l4xx_hal_rcc.h>
#include <stm32l4xx_hal_rcc_ex.h>
#include <stm32l4xx_hal_spi.h>
#include <stm32l4xx_hal_tim.h>
#include <stm32l4xx_hal_tim_ex.h>
#include <stm32l4xx_hal_uart.h>
#include <stm32l4xx_hal_uart_ex.h>
#include <sys/_stdint.h>

#include "stepper.h"
#include "magneto.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
I2C_HandleTypeDef hi2c1;
I2C_HandleTypeDef hi2c2;

SPI_HandleTypeDef hspi2;

TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim4;

UART_HandleTypeDef huart2;

/* USER CODE BEGIN PV */

I2C_HandleTypeDef *hi2cflick = &hi2c1;

SPI_HandleTypeDef *hnucleo_Spi = &hspi2;

int pulse_cnt;
int servo_speed=50;
uint8_t rotation_cnt=0;
uint8_t position = 0;

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_TIM4_Init(void);
static void MX_TIM2_Init(void);
static void MX_SPI2_Init(void);
static void MX_I2C1_Init(void);
static void MX_I2C2_Init(void);
/* USER CODE BEGIN PFP */

void StInit(void);
void StMenu(void);
void StAzimuth(void);
void StRange(void);
void StEdit (void);
void StSpeed (void);
void flick_set_value(uint16_t *value, uint16_t min_value, uint16_t max_value);

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

void (*state_array[])() = {StInit, StMenu, StAzimuth,StRange,StEdit,StSpeed};
/* an enumerated type used for indexing the state_array */
typedef enum {ST_INIT, ST_MENU, ST_AZIMUTH, ST_RANGE, ST_EDIT,ST_SPEED} state_name_t;
//typedef enum {ST_AZIMUTH, ST_RANGE} mode_name_t;
state_name_t current_state;
state_name_t last_state;
state_name_t select_mode;
//mode_name_t select_mode;

uint8_t opt;
uint8_t last_opt;

uint16_t set_angle_1;
uint16_t set_angle_2;

uint32_t gesture, touch;
airwheel_data_t airwheel;

//stepper
STEPPER stepper;

//void Pulse_Counter(void)
//{
//	if (pulse_cnt > 0) pulse_cnt--;
//	else
//	{
//		HAL_TIM_PWM_Stop_IT(&htim2, TIM_CHANNEL_2);
//		__HAL_TIM_SET_COUNTER(&htim2, 2000);
//	}
//}
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */
  current_state = ST_INIT;
  last_state = ST_INIT;
  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_USART2_UART_Init();
  MX_TIM4_Init();
  MX_TIM2_Init();
  MX_SPI2_Init();
  MX_I2C1_Init();
  MX_I2C2_Init();
  /* USER CODE BEGIN 2 */






  /* Magneto */
  /* cfg magneto */

  /*wpisanie funkcji cfg*/
  cfg_magneto(&hi2c2);


  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */

	  state_array[current_state]();

// przemyśleć gdzie umieścić

	stepper_set_destination(&stepper,5,2);
	stepper_set_speed(&stepper, 95);
	stepper_proceed(&stepper);
	  while(stepper.is_working)
	  {}
	  HAL_Delay(500);
	  stepper_set_destination(&stepper,250,2);
	  stepper_set_speed(&stepper, 15);
	  stepper_proceed(&stepper);
	  while(stepper.is_working)
	  {}
	  HAL_Delay(500);
	  
	  uint8_t magneto_status;
	  	  int16_t magneto_z, magneto_x, magneto_y;
	  	  uint8_t *p_magneto_x = (uint8_t*) &magneto_x;
	  	  uint8_t *p_magneto_y = (uint8_t*) &magneto_y;
	  	  uint8_t *p_magneto_z = (uint8_t*) &magneto_z;

		  HAL_I2C_Mem_Read(&hi2c2, ACC_MAGNETO_ADDR, LIS3MDL_MAG_STATUS_REG, I2C_MEMADD_SIZE_8BIT, &magneto_status, 1, 1);

		  if (magneto_status & (1 << 0)){
			  HAL_I2C_Mem_Read(&hi2c2, ACC_MAGNETO_ADDR, LIS3MDL_MAG_OUTX_L, I2C_MEMADD_SIZE_8BIT, p_magneto_x, 1, 1);
			  HAL_I2C_Mem_Read(&hi2c2, ACC_MAGNETO_ADDR, LIS3MDL_MAG_OUTX_H, I2C_MEMADD_SIZE_8BIT, p_magneto_x+1, 1, 1);
	 	 }
		  if (magneto_status & (1 << 1)){
		  			  HAL_I2C_Mem_Read(&hi2c2, ACC_MAGNETO_ADDR, LIS3MDL_MAG_OUTY_L, I2C_MEMADD_SIZE_8BIT, p_magneto_y, 1, 1);
		  			  HAL_I2C_Mem_Read(&hi2c2, ACC_MAGNETO_ADDR, LIS3MDL_MAG_OUTY_H, I2C_MEMADD_SIZE_8BIT, p_magneto_y+1, 1, 1);
		  	 	 }
		  if (magneto_status & (1 << 2)){
		  			  HAL_I2C_Mem_Read(&hi2c2, ACC_MAGNETO_ADDR, LIS3MDL_MAG_OUTZ_L, I2C_MEMADD_SIZE_8BIT, p_magneto_z, 1, 1);
		  			  HAL_I2C_Mem_Read(&hi2c2, ACC_MAGNETO_ADDR, LIS3MDL_MAG_OUTZ_H, I2C_MEMADD_SIZE_8BIT, p_magneto_z+1, 1, 1);
		  	 	 }

