MathDaw/SMWM_STM32/Core/Src/main.c
}

/* USER CODE BEGIN 4 */
void StInit(void)
{
	/* Stepstick */
	  HAL_TIM_Base_Start(&htim4);

	  HAL_GPIO_WritePin(MOT_RESET_GPIO_Port, MOT_RESET_Pin, GPIO_PIN_RESET);
	  HAL_GPIO_WritePin(MOT_MODE1_GPIO_Port, MOT_MODE1_Pin, GPIO_PIN_RESET);
	  HAL_GPIO_WritePin(MOT_MODE2_GPIO_Port, MOT_MODE2_Pin, GPIO_PIN_SET);
	  HAL_GPIO_WritePin(MOT_RESET_GPIO_Port, MOT_RESET_Pin, GPIO_PIN_SET);

	  /* LCD */
	  BSP_LCD_Init();
	  BSP_LCD_DisplayOn();

//	  BSP_LCD_DisplayStringAtLine(2, (uint8_t *) "testTestTest");
//	  HAL_Delay(1000);
//	  BSP_LCD_Clear(LCD_COLOR_YELLOW);
//	  HAL_Delay(1000);
//	  BSP_LCD_DisplayStringAtLine(3, (uint8_t *) "test");
//	  HAL_Delay(1000);

	  /* Sensors */
	  HAL_I2C_Init(&hi2c1);
	  HAL_I2C_Init(&hi2c2);

	  /* Flick */
	  flick_reset();
	  flick_set_param(0x90, 0x20, 0x20);

/* Stepstick */

  /*
   * Stary kod
  HAL_TIM_Base_Start(&htim4);

  HAL_GPIO_WritePin(MOT_RESET_GPIO_Port, MOT_RESET_Pin, GPIO_PIN_RESET);
  HAL_GPIO_WritePin(MOT_MODE1_GPIO_Port, MOT_MODE1_Pin, GPIO_PIN_RESET);
  HAL_GPIO_WritePin(MOT_MODE2_GPIO_Port, MOT_MODE2_Pin, GPIO_PIN_SET);
  HAL_GPIO_WritePin(MOT_RESET_GPIO_Port, MOT_RESET_Pin, GPIO_PIN_SET);
  */
  /*
   * #define MOT_REF_Pin GPIO_PIN_7
  #define MOT_REF_GPIO_Port GPIOC
  #define MOT_DIR1_Pin GPIO_PIN_8
  #define MOT_DIR1_GPIO_Port GPIOA
  #define MOT_RESET_Pin GPIO_PIN_9
  #define MOT_RESET_GPIO_Port GPIOA
  #define MOT_FAULT_Pin GPIO_PIN_10
  #define MOT_FAULT_GPIO_Port GPIOA
  #define MOT_PWM1_Pin GPIO_PIN_3
  #define MOT_PWM1_GPIO_Port GPIOB
  #define MOT_MODE1_Pin GPIO_PIN_4
  #define MOT_MODE1_GPIO_Port GPIOB
  #define MOT_MODE2_Pin GPIO_PIN_6
  #define MOT_MODE2_GPIO_Port GPIOB
   */

  stepper = stepper_inizialize(
			GPIOC, GPIO_PIN_7,
			GPIOA, GPIO_PIN_8,
			GPIOA, GPIO_PIN_9,
			GPIOA, GPIO_PIN_10,
			GPIOB, GPIO_PIN_4,
			GPIOB, GPIO_PIN_6,
			&htim2, TIM_CHANNEL_2);


	  /* IMU */
	  uint8_t i2c2_buf[10];
	  HAL_I2C_Mem_Read(&hi2c2, ACC_GYRO_ADDR, WHO_AM_I, I2C_MEMADD_SIZE_8BIT, i2c2_buf, 1, 1);
	  HAL_I2C_Mem_Read(&hi2c2, 0x1e<<1, 0x0f, I2C_MEMADD_SIZE_8BIT, i2c2_buf+1, 1, 1);

//	  char str[40];
//	  sprintf(str, "Who? A/G:%02x M:%02x", i2c2_buf[0], i2c2_buf[1]);
//	  BSP_LCD_DisplayStringAtLine(10, (uint8_t *) str);

	  /* cfg gyro */
	  i2c2_buf[0] = 0x38;		// enable X,Y,Z axes
	  HAL_I2C_Mem_Write(&hi2c2, ACC_GYRO_ADDR, CTRL10_C, I2C_MEMADD_SIZE_8BIT, i2c2_buf, 1, 1);
	  i2c2_buf[0] = 0x14;		// 13 Hz ODR, 500 dps
	  HAL_I2C_Mem_Write(&hi2c2, ACC_GYRO_ADDR, CTRL2_G, I2C_MEMADD_SIZE_8BIT, i2c2_buf, 1, 1);

	  // cfg acc
	  i2c2_buf[0] = 0x38;		// enable X,Y,Z axes
	  HAL_I2C_Mem_Write(&hi2c2, ACC_GYRO_ADDR, CTRL9_XL, I2C_MEMADD_SIZE_8BIT, i2c2_buf, 1, 1);
	  i2c2_buf[0] = 0x10;		// 13 Hz ODR, +/- 2 g
	  HAL_I2C_Mem_Write(&hi2c2, ACC_GYRO_ADDR, CTRL1_XL, I2C_MEMADD_SIZE_8BIT, i2c2_buf, 1, 1);

	  current_state = ST_MENU;
}

void StMenu(void)
{
	flick_poll_data(&gesture, &touch, &airwheel);

	if(current_state != last_state)
	{
		char str[40];
		BSP_LCD_Clear(LCD_COLOR_WHITE);

		sprintf(str, "MENU");
		BSP_LCD_DisplayStringAt(0, 1, (uint8_t *) str, CENTER_MODE);

		sprintf(str, "Wybierz opcje:");
		BSP_LCD_DisplayStringAt(0, 15, (uint8_t *) str, CENTER_MODE);

		sprintf(str, "<- Wybor trybu");
		BSP_LCD_DisplayStringAt(0, 70, (uint8_t *) str, LEFT_MODE);

		sprintf(str, "Ustaw predkosc ->");
		BSP_LCD_DisplayStringAt(0, 90, (uint8_t *) str, RIGHT_MODE);

		sprintf(str, "Aktywuj");
		BSP_LCD_DisplayStringAt(0, 147, (uint8_t *) str, CENTER_MODE);

		last_state = current_state;
	}

	// Odczyt gestu flick

	flick_interaction_t interaction=flick_get_interaction(gesture,touch,airwheel);

	// Przejście do odpowiedniego stanu

//	if(interaction == FLICK_NO_INTERACTION)
//	{
//		BSP_LCD_Clear(LCD_COLOR_YELLOW);
//		HAL_Delay(500);
//	}

	if(interaction == FLICK_TOUCH_LEWO)
	{
		current_state = ST_EDIT;
	}
	if(interaction == FLICK_TOUCH_PRAWO)
	{
		current_state = ST_SPEED;
	}
	if(interaction == FLICK_TOUCH_DOL)
	{
		current_state = select_mode;
	}
}
void StAzimuth(void)
{
	char str[40];
	uint8_t angle = 0;
	uint8_t last_angle = 0;

	// dodać odczyt z magnetometru

	flick_poll_data(&gesture, &touch, &airwheel);

	if(current_state != last_state)
	{
		BSP_LCD_Clear(LCD_COLOR_WHITE);

		sprintf(str, "Utrzymanie azymutu");
		BSP_LCD_DisplayStringAt(0, 10, (uint8_t *) str, CENTER_MODE);
		BSP_LCD_DisplayStringAt(0, 20, "N", CENTER_MODE);

		sprintf(str, "Powrot do MENU");
		BSP_LCD_DisplayStringAt(0, 147, (uint8_t *) str, CENTER_MODE);
		last_state = current_state;
	}

	uint8_t set_angle_1 = 3.14/3;	// kat testowy
	if (set_angle_1 != angle)
	{
		LCD_PrintDirection(set_angle_1, set_angle_1, 64, 80, 50, LCD_COLOR_BLACK); // zadany azymut
	}

	angle = 3.14/4;	// kat testowy
	LCD_PrintDirection(angle, last_angle, 64, 80, 50, LCD_COLOR_RED); //aktualny azymut

	last_angle = angle;

	// dodać sterowanie silnikiem

	// Przejść do stanu Menu
	flick_interaction_t interaction = flick_get_interaction(gesture,touch,airwheel);

	if(interaction == FLICK_TOUCH_SRODEK)
	{
		current_state = ST_MENU;
	}
}
void StRange(void)
{
	char str[40];

	uint8_t angle;

	// dodać odczyt z magnetometru

	flick_poll_data(&gesture, &touch, &airwheel);
	if(current_state != last_state)
	{
		BSP_LCD_Clear(LCD_COLOR_WHITE);

		sprintf(str, "Zakres");
		BSP_LCD_DisplayStringAt(0, 10, (uint8_t *) str, CENTER_MODE);

		sprintf(str, "Powrot do MENU");
		BSP_LCD_DisplayStringAt(0, 147, (uint8_t *) str, CENTER_MODE);
		last_state = current_state;
	}

	angle = 0;	// kat testowy
	LCD_PrintDirection(angle, angle, 64, 80, 50, LCD_COLOR_RED); //aktualny azymut

	//dodać zadany przez użytkownika dolny ogranicznik
	uint8_t set_angle_1 = 0;	// kat testowy
	LCD_PrintDirection(set_angle_1, set_angle_1, 64, 80, 50, LCD_COLOR_BLACK); //ogranicznik 1

	//dodać zadany przez użytkownika gorny ogranicznik
	uint8_t set_angle_2 = 0;	// kat testowy
	LCD_PrintDirection(set_angle_2, set_angle_2, 64, 80, 50, LCD_COLOR_BLACK); // ogranicznik 2


	//dodać sterowanie silnikiem


	// Przejść do stanu Menu
	flick_interaction_t interaction = flick_get_interaction(gesture,touch,airwheel);

