MathDaw/SMWM_STM32/Core/Src/main.c
	if(interaction == FLICK_TOUCH_SRODEK)
	{
		current_state = ST_MENU;
	}
}
void StEdit (void)
{
	char str[40];

	flick_poll_data(&gesture, &touch, &airwheel);
	if(current_state != last_state)
	{
		opt = 0;
		last_opt = 1;
	}
	switch (opt)
	{
	case 0:
		if(last_opt != opt)
		{
			BSP_LCD_Clear(LCD_COLOR_WHITE);
			sprintf(str, "Wybierz tryb");
			BSP_LCD_DisplayStringAt(0, 10, (uint8_t *) str, CENTER_MODE);

			sprintf(str, "Zatwierdz");
			BSP_LCD_DisplayStringAt(0, 147, (uint8_t *) str, CENTER_MODE);
		}

		uint8_t tmp = 0;
		flick_set_value(&tmp, ST_AZIMUTH*10, ST_RANGE*10);
		select_mode = tmp/10;

		if(select_mode == ST_AZIMUTH)
		{
			sprintf(str, "     Azymut    ");
			BSP_LCD_DisplayStringAt(0, 60, (uint8_t *) str, CENTER_MODE);
		}
		if(select_mode == ST_RANGE)
		{
			sprintf(str, "     Zakres     ");
			BSP_LCD_DisplayStringAt(0, 60, (uint8_t *) str, CENTER_MODE);
		}
		last_opt = opt;
		break;

	case 1:
		if(last_opt != opt)
		{
			BSP_LCD_Clear(LCD_COLOR_WHITE);
			sprintf(str, "Podaj dolna wartosc ograniczajaca");
			BSP_LCD_DisplayStringAt(0, 10, (uint8_t *) str, CENTER_MODE);

			sprintf(str, "Zatwierdz");
			BSP_LCD_DisplayStringAt(0, 147, (uint8_t *) str, CENTER_MODE);
		}

		flick_set_value(&set_angle_1, 0, 360);

		sprintf(str, "   %02x   ", set_angle_1);
		BSP_LCD_DisplayStringAt(0, 60, (uint8_t *) str, CENTER_MODE);

		last_opt = opt;
		break;

	case 2:
		if(select_mode == ST_RANGE)
		{
			if(last_opt != opt)
			{
				BSP_LCD_Clear(LCD_COLOR_WHITE);
				sprintf(str, "Podaj gorna wartosc ograniczajaca");
				BSP_LCD_DisplayStringAt(0, 10, (uint8_t *) str, CENTER_MODE);

				sprintf(str, "Zatwierdz");
				BSP_LCD_DisplayStringAt(0, 147, (uint8_t *) str, CENTER_MODE);
			}

			flick_set_value(&set_angle_2, 0, 360);

			sprintf(str, "   %02x   ", set_angle_2);
			BSP_LCD_DisplayStringAt(0, 60, (uint8_t *) str, CENTER_MODE);

			last_opt = opt;
		}
		else opt++;
		break;

	default:
		current_state = ST_MENU;
		break;
	}

	// odczyt z flick

//	if(select_mode == ST_RANGE)
//	{
//		BSP_LCD_Clear(LCD_COLOR_WHITE);
//		sprintf(str, "Podaj gorna wartosc ograniczajaca");
//		BSP_LCD_DisplayStringAt(0, 10, (uint8_t *) str, CENTER_MODE);
//
//		sprintf(str, "   %02x   ", set_angle_2);
//		BSP_LCD_DisplayStringAt(0, 60, (uint8_t *) str, CENTER_MODE);
//	}

	// odczyt z flick

	// przejscie do kolejnej opcji
	flick_interaction_t interaction = flick_get_interaction(gesture,touch,airwheel);
	if(interaction == FLICK_TOUCH_SRODEK)
	{
		opt++;
	}
}
void StSpeed (void)
{
	char str[40];
	flick_poll_data(&gesture, &touch, &airwheel);
	if(current_state != last_state)
	{
		BSP_LCD_Clear(LCD_COLOR_WHITE);

		sprintf(str, "Podaj prędkosc silnika");
		BSP_LCD_DisplayStringAt(0, 10, (uint8_t *) str, CENTER_MODE);

		sprintf(str, "Zatwierdz");
		BSP_LCD_DisplayStringAt(0, 147, (uint8_t *) str, CENTER_MODE);
		last_state = current_state;
	}


	// odczyt z flick i zmiana predkosci

	//wyswietlenie nastawionej predkosci
//	sprintf(str, "   %02x   ", servo_speed);
//	BSP_LCD_DisplayStringAt(0, 60, (uint8_t *) str, CENTER_MODE);

	// zatwierdz kliknieciem
	flick_interaction_t interaction = flick_get_interaction(gesture,touch,airwheel);
	if(interaction == FLICK_TOUCH_SRODEK)
	{
		current_state = ST_MENU;
	}
}
void flick_set_value(uint16_t *value, uint16_t min_value, uint16_t max_value)
{
	flick_interaction_t interaction = flick_get_interaction(gesture,touch,airwheel);
	if(interaction == FLICK_TOUCH_LEWO)
	{
		value = value - 10;
		if(value < min_value) value = min_value;
	}
	if(interaction == FLICK_TOUCH_LEWO)
	{
		value = value + 10;
		if(value > max_value) value = max_value;
	}
}
// sprawdzić

void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef* htim)
{
	if(htim==stepper.Timer)
	{
		stepper.position+=stepper.direction;
		if(stepper.state==1)
		{
			if(stepper.position==stepper.destination[0])
			{
				HAL_TIM_PWM_Stop(stepper.Timer, stepper.Channel);
				HAL_TIM_Base_Stop_IT(stepper.Timer);
				stepper.is_working=0;
				stepper.state=0;
			}
		}
		else if(stepper.state==2)
		{
			if(stepper.position==stepper.destination[2])
			{
				stepper.speed=stepper.speed/2;
				__HAL_TIM_SET_PRESCALER(stepper.Timer, stepper.speed);
			}
			else if(stepper.position==stepper.destination[1])
			{
				stepper.speed=stepper.speed*2;
				__HAL_TIM_SET_PRESCALER(stepper.Timer, stepper.speed);
			}
			else if(stepper.position==stepper.destination[0])
			{
				HAL_TIM_PWM_Stop(stepper.Timer, stepper.Channel);
				HAL_TIM_Base_Stop_IT(stepper.Timer);
				stepper.is_working=0;
				stepper.state=0;
				stepper.speed=stepper.speed/2;
				__HAL_TIM_SET_PRESCALER(stepper.Timer, stepper.speed);
			}
		}
	}
}

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */

  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     tex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
